Project2/tdd/TravelGoodCA/test/createIT/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:trav="http://service.bpel.travelagency.webservice.dtu.dk/wsdl/TravelGood2BpelModule/src/TravelGoodWSDL">
  <soapenv:Body>
    <trav:createItinerary>
      <ItineraryID>d08ba1ee-20dd-11e6-b67b-9e71128cae77</ItineraryID>
    </trav:createItinerary>
  </soapenv:Body>
</soapenv:Envelope>