Project2/tdd/TravelGoodCA/test/TestCase1/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ser="http://service.airline.webservice.dtu.dk/">
  <soapenv:Body>
    <ser:getFlights>
      <!--Optional:-->
      <startDestination>Copenhagen</startDestination>
      <!--Optional:-->
      <endDestination>Tokyo</endDestination>
      <!--Optional:-->
      <startDate>2017-02-01</startDate>
    </ser:getFlights>
  </soapenv:Body>
</soapenv:Envelope>